<a href="https://colab.research.google.com/github/luisrobertobd/CasoEstudio_BdB_Python/blob/master/Taller4_dataframes_py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

datos = {
    'Manzanas': [3, 2, 0, 1, 6, 3, 1], 
    'Naranjas': [0, 3, 7, 2, 4, 2, 3],
    'Peras': [4, 0, 0, 3, 8, 1, 3],
    'Kiwi': [1, 2, 0, 3, 1, 1, 3]
}

compras = pd.DataFrame(datos)
compras = pd.DataFrame(datos, index = ['June', 'Robert', 'Lily', 'David', 'Laura', 'Fabio', 'Ana'])

In [ ]:
compras
#compras.head(2)

In [ ]:
#compras.index
#compras.columns
#compras.describe()
compras [compras['Manzanas'] > 1]

In [ ]:
import pandas as pd
print("Compras de manzanas: \n", compras['Manzanas'])

print("Compras de manzanas y naranjas: \n", compras[['Manzanas', 'Naranjas']])

print("Compras de Robert: \n", compras.loc['Robert'] )

print("Compras de Robert en Peras y Kiwi: \n", compras.loc['Robert', ['Peras', 'Kiwi']])

print("Compras de Robert y Fabio en peras y kiwi: \n", compras.loc[['Robert', 'Fabio'], ['Peras', 'Kiwi']])

print("Compras de Lily en manzanas: \n", compras.iloc[2, 0])

print("Compras de kiwis y manzanas por todos: \n", compras.iloc[:, [0, 3]])

print("Compras de manzanas mayor a 1: \n", compras[compras['Manzanas'] > 1 ])

Manejo de Strings  en dataframes

In [ ]:
import pandas as pd
empresas= {'nombres':['banco Sudameris',
                      'bAnColomBia',
                      'BANIstmo',
                      'banco popular',
                      'Colpatria',
                      'porVENIR']}



df_empresas = pd.DataFrame(empresas)

print (df_empresas)
print(df_empresas['nombres'].str.lower())
 

print(df_empresas['nombres'].str.upper())

print(df_empresas['nombres'].str.capitalize())

print(df_empresas['nombres'].str.len())

print(df_empresas['nombres'].str.split(' '))

print(df_empresas['nombres'].str[:3])

print(df_empresas['nombres'].str.replace('popular', 'occidente'))

print(df_empresas['nombres'].str.lower().str.findall('ban'))

print(df_empresas['nombres'].str.lower().str.count('b'))

           nombres
0  banco Sudameris
1      bAnColomBia
2         BANIstmo
3    banco popular
4        Colpatria
5         porVENIR
0    banco sudameris
1        bancolombia
2           banistmo
3      banco popular
4          colpatria
5           porvenir
Name: nombres, dtype: object
0    BANCO SUDAMERIS
1        BANCOLOMBIA
2           BANISTMO
3      BANCO POPULAR
4          COLPATRIA
5           PORVENIR
Name: nombres, dtype: object
0    Banco sudameris
1        Bancolombia
2           Banistmo
3      Banco popular
4          Colpatria
5           Porvenir
Name: nombres, dtype: object
0    15
1    11
2     8
3    13
4     9
5     8
Name: nombres, dtype: int64
0    [banco, Sudameris]
1         [bAnColomBia]
2            [BANIstmo]
3      [banco, popular]
4           [Colpatria]
5            [porVENIR]
Name: nombres, dtype: object
0    ban
1    bAn
2    BAN
3    ban
4    Col
5    por
Name: nombres, dtype: object
0    banco Sudameris
1        bAnColomBia
2           BANIstmo
3    banco occidente
4          Colpatria
5           porVENIR
Name: nombres, dtype: object
0    [ban]
1    [ban]
2    [ban]
3    [ban]
4       []
5       []
Name: nombres, dtype: object
0    1
1    2
2    1
3    1
4    0
5    0
Name: nombres, dtype: int64

In [ ]:
Agrupaciones

In [ ]:
ventas = pd.DataFrame({
    "Categoria": [1, 2, 1, 1, 2, 1],
    "Producto": ["A", "B", "C", "B", "A", "A"],
    "Ventas": [6, 2, 1, 4, 5, 2],
    "Nombre": ["7a", 8, 4, 4, 2, "ab"]
    })

print (ventas.columns)
print(ventas.describe())
print(ventas)
print( ventas  [['Categoria' , 'Ventas']]  [ventas["Categoria"]==1  ]   )
print(ventas.groupby('Producto').mean())

print("\n")

print(ventas.groupby(['Categoria', 'Producto']).mean())

print(ventas.groupby('Producto').sum() )
print(    ventas.groupby(['Producto'])  ['Ventas'].sum() )
print(ventas.groupby(['Producto' , 'Categoria']) ['Ventas'].sum()   )
print(ventas.groupby(['Producto' , 'Categoria']) ['Ventas'].sum().unstack()[2]  )

Index(['Categoria', 'Producto', 'Ventas', 'Nombre'], dtype='object')
       Categoria    Ventas
count   6.000000  6.000000
mean    1.333333  3.333333
std     0.516398  1.966384
min     1.000000  1.000000
25%     1.000000  2.000000
50%     1.000000  3.000000
75%     1.750000  4.750000
max     2.000000  6.000000
   Categoria Producto  Ventas Nombre
0          1        A       6     7a
1          2        B       2      8
2          1        C       1      4
3          1        B       4      4
4          2        A       5      2
5          1        A       2     ab
   Categoria  Ventas
0          1       6
2          1       1
3          1       4
5          1       2
          Categoria    Ventas
Producto
A          1.333333  4.333333
B          1.500000  3.000000
C          1.000000  1.000000


                    Ventas
Categoria Producto
1         A              4
          B              4
          C              1
2         A              5
          B              2
          Categoria  Ventas
Producto
A                 4      13
B                 3       6
C                 1       1
Producto
A    13
B     6
C     1
Name: Ventas, dtype: int64
Producto  Categoria
A         1            8
          2            5
B         1            4
          2            2
C         1            1
Name: Ventas, dtype: int64
Producto
A    5.0
B    2.0
C    NaN
Name: 2, dtype: float64

Manejo de indices

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving 3.1.4-poblacion.csv to 3.1.4-poblacion.csv

In [ ]:


df_poblacion = pd.read_csv('3.1.4-poblacion.csv')


##field Country as  index  
df_poblacion.set_index(['Country'])

df_un_indice = df_poblacion.set_index(['Country'])
print (df_poblacion)
print (df_un_indice)
##### fields country, years  as  index  
#df_multi_indice = df_poblacion.set_index(['Country', 'year'])
#print (df_multi_indice )   
#df_multi_indice = df_multi_indice.sort_index()
#df_multi_indice 
##print(df_multi_indice)

#print(df_multi_indice.xs(['Colombia']))
#print(df_multi_indice.xs('Zimbabwe'))
##print(df_multi_indice.loc[pd.IndexSlice['Chile': 'Cuba', '2015': '2017'], :].sort_index())

##print(df_multi_indice.sum(level = 'year'))

##print (df_multi_indice.groupby(level=1).sum())


##print(df_multi_indice.loc[pd.IndexSlice['Chile': 'Cuba', '2015': '2017'], :].sort_index())

                       Country  year           pop
0                  Afghanistan  2015           NaN
1                      Albania  2015           NaN
2                      Algeria  2015           NaN
3               American Samoa  2015  5.581200e+04
4                      Andorra  2015  7.801100e+04
...                        ...   ...           ...
1035  Pre-demographic dividend  2018  9.194854e+08
1036              Small states  2018  4.057532e+07
1037                South Asia  2018  1.814389e+09
1038   South Asia (IDA & IBRD)  2018  1.814389e+09
1039        Sub-Saharan Africa  2018  1.078307e+09

[1040 rows x 3 columns]
                          year           pop
Country
Afghanistan               2015           NaN
Albania                   2015           NaN
Algeria                   2015           NaN
American Samoa            2015  5.581200e+04
Andorra                   2015  7.801100e+04
...                        ...           ...
Pre-demographic dividend  2018  9.194854e+08
Small states              2018  4.057532e+07
South Asia                2018  1.814389e+09
South Asia (IDA & IBRD)   2018  1.814389e+09
Sub-Saharan Africa        2018  1.078307e+09

[1040 rows x 2 columns]

--->  NULOS

In [ ]:
import numpy as np
import pandas as pd

ventas = pd.DataFrame({"A":[3, np.nan , 1],
                "B":[1, 5, np.nan ],
                "C":[3, 7, 2],
                "D":[4, 2,np.nan ]} )
                #index = ["Ene", "Feb", "Mar"])
print (ventas)

ventas.set_index(['A'])

print(ventas.dropna(1))

     A    B  C    D
0  3.0  1.0  3  4.0
1  NaN  5.0  7  2.0
2  1.0  NaN  2  NaN
   C
0  3
1  7
2  2

In [ ]:
import numpy as np
import pandas as pd

ventas = pd.DataFrame({"A":[3, np.nan , 1],
                "B":[1, 5, np.nan ],
                "C":[3, 7, 2],
                "D":[4, 2,np.nan ]} )
                #index = ["Ene", "Feb", "Mar"])

df_poblacion.set_index(['A'])

print(ventas)

print(ventas.isnull())

print(ventas.dropna())

print(ventas.fillna(0))


print(ventas)

ventas_depurado= ventas.fillna(0)

print (ventas_depurado)

       A    B  C    D
Ene  3.0  1.0  3  4.0
Feb  NaN  5.0  7  2.0
Mar  1.0  NaN  2  NaN
         A      B      C      D
Ene  False  False  False  False
Feb   True  False  False  False
Mar  False   True  False   True
       A    B  C    D
Ene  3.0  1.0  3  4.0
       A    B  C    D
Ene  3.0  1.0  3  4.0
Feb  0.0  5.0  7  2.0
Mar  1.0  0.0  2  0.0
       A    B  C    D
Ene  3.0  1.0  3  4.0
Feb  NaN  5.0  7  2.0
Mar  1.0  NaN  2  NaN
       A    B  C    D
Ene  3.0  1.0  3  4.0
Feb  0.0  5.0  7  2.0
Mar  1.0  0.0  2  0.0

5) VALORES REPETIDOS

In [ ]:
estudiantes = [('jack', 34, 'Sydeny'),
               ('Riti', 30, 'Delhi'),
               ('Aadi', 16, 'New York'),
               ('Riti', 30, 'Delhi'),
               ('Riti', 30, 'Delhi'),
               ('Riti', 30, 'Mumbai'),
               ('Aadi', 40, 'London'),
               ('Sachin', 30, 'Delhi')
               ]
print (estudiantes )
df_estudiantes = pd.DataFrame(estudiantes, columns=['Nombre', 'Edad', 'Ciudad'])

print (df_estudiantes )
##print(df_estudiantes.duplicated())

###print("\n")

##print(df_estudiantes.duplicated(['Nombre']))
print(df_estudiantes.drop_duplicates(['Nombre']))

print(df_estudiantes.drop_duplicates('Nombre'))

print (df_estudiantes )

[('jack', 34, 'Sydeny'), ('Riti', 30, 'Delhi'), ('Aadi', 16, 'New York'), ('Riti', 30, 'Delhi'), ('Riti', 30, 'Delhi'), ('Riti', 30, 'Mumbai'), ('Aadi', 40, 'London'), ('Sachin', 30, 'Delhi')]
   Nombre  Edad    Ciudad
0    jack    34    Sydeny
1    Riti    30     Delhi
2    Aadi    16  New York
3    Riti    30     Delhi
4    Riti    30     Delhi
5    Riti    30    Mumbai
6    Aadi    40    London
7  Sachin    30     Delhi
   Nombre  Edad    Ciudad
0    jack    34    Sydeny
1    Riti    30     Delhi
2    Aadi    16  New York
7  Sachin    30     Delhi
   Nombre  Edad    Ciudad
0    jack    34    Sydeny
1    Riti    30     Delhi
2    Aadi    16  New York
7  Sachin    30     Delhi
   Nombre  Edad    Ciudad
0    jack    34    Sydeny
1    Riti    30     Delhi
2    Aadi    16  New York
3    Riti    30     Delhi
4    Riti    30     Delhi
5    Riti    30    Mumbai
6    Aadi    40    London
7  Sachin    30     Delhi

8)   --->>>> FUSIONAR

In [ ]:
import pandas as pd

df_ventas = pd.DataFrame({
            "Mes": ["ene", "feb", "mar", "may"],
            "Ventas": [14, 8, 12, 17]})

df_costos = pd.DataFrame({
            "Mes": ["feb", "ene", "mar", "abr"],
            "Costos": [7, 6, 8, 5]})

print(df_ventas) 
print(df_costos)

print(pd.merge(df_ventas, df_costos))
print(pd.merge(df_ventas, df_costos, how = "right"))

print("\n")

   Mes  Ventas
0  ene      14
1  feb       8
2  mar      12
3  may      17
   Mes  Costos
0  feb       7
1  ene       6
2  mar       8
3  abr       5
   Mes  Ventas  Costos
0  ene      14       6
1  feb       8       7
2  mar      12       8
   Mes  Ventas  Costos
0  feb     8.0       7
1  ene    14.0       6
2  mar    12.0       8
3  abr     NaN       5

9)   --->> CONCATENAR

In [ ]:
import pandas as pd

datos_estudiante_uno = pd.DataFrame({
                        'id': ['S1', 'S2', 'S3', 'S4', 'S5'],
                        'nombre': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
                        'notas': [5.0, 3.8, 1.9, 4.4, 4.1]})

datos_estudiante_dos = pd.DataFrame({
                        'id': ['S4', 'S5', 'S6', 'S7', 'S8'],
                        'nombre': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
                        'notas': [2.9, 4.8, 4.2, 3.5, 4.0],
                        'valor': [2.9, 4.8, 4.2, 3.5, 4.0]})


print (datos_estudiante_uno + datos_estudiante_dos )
print("\n")
#print(datos_estudiante_dos)
datos_concatenados = pd.concat([datos_estudiante_uno, datos_estudiante_dos])

print("\n")

print(datos_concatenados)

     id                            nombre  notas  valor
0  S1S4  Danniella FentonScarlette Fisher    7.9    NaN
1  S2S5      Ryder StoreyCarla Williamson    8.6    NaN
2  S3S6           Bryce JensenDante Morse    6.1    NaN
3  S4S7           Ed BernalKaiser William    7.9    NaN
4  S5S8        Kwame MorinMadeeha Preston    8.1    NaN




   id            nombre  notas  valor
0  S1  Danniella Fenton    5.0    NaN
1  S2      Ryder Storey    3.8    NaN
2  S3      Bryce Jensen    1.9    NaN
3  S4         Ed Bernal    4.4    NaN
4  S5       Kwame Morin    4.1    NaN
0  S4  Scarlette Fisher    2.9    2.9
1  S5  Carla Williamson    4.8    4.8
2  S6       Dante Morse    4.2    4.2
3  S7    Kaiser William    3.5    3.5
4  S8   Madeeha Preston    4.0    4.0

TALLER  
El   archivo   titanic.csv contiene información de los pasajeros del Titanic. Escriba un programa que realice lo siguiente: 

Generar un DataFrame con los datos del archivo Titanic.csv. 

0) Imprimir las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas. 

1) Imprimir los datos del pasajero con id 100. 

2) Imprimir las filas impares del DataFrame. 

3) Imprimir los nombres de las personas que iban en segunda clase ordenadas alfabéticamente. 

4) Imprimir el porcentaje de personas que sobrevivieron y murieron. 

5) Imprimir el porcentaje de personas que murieron en cada clase. 

6) Eliminar del DataFrame los pasajeros con edad desconocida. 

7) Imprimir la edad media de los hombres que viajaban en cada clase. 

8) Añadir una nueva columna para determinar si el pasajero era menor de edad o no. 

9) Imprimir el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [1]:
import pandas as pd

from google.colab import files
uploaded = files.upload()

Saving 3.1.16-titanic.csv to 3.1.16-titanic.csv

In [2]:
df_titanic = pd.read_csv('3.1.16-titanic.csv')
#df_titanic
print(df_titanic.head(10))
print(df_titanic.tail(10))
df_titanic.shape
print(df_titanic.index)
print(df_titanic.columns)
print(df_titanic.dtypes)
#df_titanic.describe()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]
     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[10 rows x 12 columns]
RangeIndex(start=0, stop=891, step=1)
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
print(df_titanic [['Name' , 'Sex','PassengerId']] [df_titanic["PassengerId"]==100])
print(df_titanic.loc[99])

                 Name   Sex  PassengerId
99  Kantor, Mr. Sinai  male          100
PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                           34
SibSp                          1
Parch                          0
Ticket                    244367
Fare                          26
Cabin                        NaN
Embarked                       S
Name: 99, dtype: object

In [ ]:
#df_titanic.iloc[0:5]
#print(df_titanic.shape[0])
print(df_titanic.iloc[range(1,df_titanic.shape[0],2)] )

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
3              4         1       1  ...  53.1000  C123         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
9             10         1       2  ...  30.0708   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
881          882         0       3  ...   7.8958   NaN         S
883          884         0       2  ...  10.5000   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C

[445 rows x 12 columns]

In [ ]:
print(df_titanic [['Name' , 'Sex','Pclass']] [df_titanic["Pclass"]==2].sort_values('Name',ascending=True))

                                                  Name     Sex  Pclass
308                                Abelson, Mr. Samuel    male       2
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female       2
144                         Andrew, Mr. Edgardo Samuel    male       2
518  Angle, Mrs. William A (Florence "Mary" Agnes H...  female       2
757                           Bailey, Mr. Percy Andrew    male       2
..                                                 ...     ...     ...
33                               Wheadon, Mr. Edward H    male       2
673                              Wilhelms, Mr. Charles    male       2
17                        Williams, Mr. Charles Eugene    male       2
199             Yrois, Miss. Henriette ("Mrs Harbeck")  female       2
361                          del Carlo, Mr. Sebastiano    male       2

[184 rows x 3 columns]

In [ ]:
print(df_titanic['Survived'].value_counts(normalize=True)*100)

0    61.616162
1    38.383838
Name: Survived, dtype: float64

In [ ]:
#print(df_titanic['Survived'].value_counts(normalize=True)*100)
print(df_titanic.groupby('Pclass')['Survived'].value_counts(normalize=True) * 100)

Pclass  Survived
1       1           62.962963
        0           37.037037
2       0           52.717391
        1           47.282609
3       0           75.763747
        1           24.236253
Name: Survived, dtype: float64

In [ ]:
print(df_titanic['Age'].dropna())
print(df_titanic.dropna(subset=['Age']))

1      38.0
2      26.0
3      35.0
4      35.0
6      54.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 713, dtype: float64
     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
6              7         0       1  ...  51.8625   E46         S
..           ...       ...     ...  ...      ...   ...       ...
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[713 rows x 12 columns]

In [5]:
#print(df_titanic['Survived'].value_counts(normalize=True)*100)
#print(df_titanic.groupby('Pclass')['Survived'].value_counts(normalize=True) * 100)
values= [ 'female']
df_titanic[~df_titanic.Sex.isin(values)]
##df_titanic_hombres = df_titanic [df_titanic["Sex"]=='male']
##print(df_titanic_hombres.groupby(['Pclass', 'Survived'])['Age'].mean())

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[577 rows x 12 columns]

In [ ]:
print (df_titanic['Age'] )
df_titanic['Age'] <18
df_titanic ['mayorEdad'] = df_titanic ['Age'] < 18

print (df_titanic[['Age' , 'mayorEdad']]  [ df_titanic['Age'] < 18]  )

#print(df_titanic.max())
df_titanic['Age'].max() 
df_titanic.max()
## 9) Imprimir el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.
print(df_titanic.groupby(['Pclass', 'mayorEdad'])['Survived'].value_counts(normalize=True) * 100)

print(df_titanic.groupby(['Pclass', 'mayorEdad'])['Survived'].value_counts(normalize=True).unstack()[1] * 100  )

print(df_titanic.groupby(['Pclass', 'Survived'])['mayorEdad'].value_counts(normalize=True) * 100  )
print(df_titanic.groupby(['Pclass', 'Survived'])['mayorEdad'].value_counts(normalize=True).unstack()[1] * 100  )
print(df_titanic.groupby(['Pclass', 'Survived'])['mayorEdad'].value_counts(normalize=True).unstack()[0] * 100  )

0       NaN
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64
      Age  mayorEdad
7     2.0       True
9    14.0       True
10    4.0       True
14   14.0       True
16    2.0       True
..    ...        ...
850   4.0       True
852   9.0       True
853  16.0       True
869   4.0       True
875  15.0       True

[113 rows x 2 columns]
Pclass  mayorEdad  Survived
1       False      1           61.274510
                   0           38.725490
        True       1           91.666667
                   0            8.333333
2       False      0           59.006211
                   1           40.993789
        True       1           91.304348
                   0            8.695652
3       False      0           78.208232
                   1           21.791768
        True       0           62.820513
                   1           37.179487
Name: Survived, dtype: float64
Pclass  mayorEdad
1       False        61.274510
        True         91.666667
2       False        40.993789
        True         91.304348
3       False        21.791768
        True         37.179487
Name: 1, dtype: float64
Pclass  Survived  mayorEdad
1       0         False        98.750000
                  True          1.250000
        1         False        91.911765
                  True          8.088235
2       0         False        97.938144
                  True          2.061856
        1         False        75.862069
                  True         24.137931
3       0         False        86.827957
                  True         13.172043
        1         False        75.630252
                  True         24.369748
Name: mayorEdad, dtype: float64
Pclass  Survived
1       0            1.250000
        1            8.088235
2       0            2.061856
        1           24.137931
3       0           13.172043
        1           24.369748
Name: True, dtype: float64
Pclass  Survived
1       0           98.750000
        1           91.911765
2       0           97.938144
        1           75.862069
3       0           86.827957
        1           75.630252
dtype: float64